/***
	***************************************************************************************************
	*	@file  	main.c
	*	@version V1.0
	*	@author  鹿小班科技	
	*	@brief   LED闪烁实验
   ****************************************************************************************************
   *  @description
	*
	*	实验平台：鹿小班STM32F407VET6核心板 （型号：LXB407VE-P1）
	*	客服微信：19949278543
	*
>>>>> 功能说明：
	*
	*	1.LED闪烁
	* 	
	***************************************************************************************************
***/


#include "stm32f4xx.h"
#include "led.h"   
#include "delay.h"


int main(void)
{
	Delay_Init();		//延时函数初始化
	LED_Init();			//LED初始化

	while (1)
	{		
		LED1_Toggle;
		Delay_ms(100);	
	}	
}





