/***
	***************************************************************************************************
	*	@file  	main.c
	*	@version V1.0
	*	@author  鹿小班科技	
	*	@brief   串口实验
   ****************************************************************************************************
   *  @description
	*
	*	实验平台：鹿小班STM32F407VET6核心板 （型号：LXB407VE-P1）
	*	客服微信：19949278543
	*
>>>>> 功能说明：
	*
	*	串口打印测试
	* 		
	***************************************************************************************************
***/


#include "stm32f4xx.h"
#include "led.h"   
#include "delay.h"
#include "key.h"  
#include "usart.h"

/***************************************************************************************************
*	函 数 名: main
*	入口参数: 无
*	返 回 值: 无
*	函数功能: 运行主程序
*	说    明: 无
****************************************************************************************************/

int main(void)
{
	uint16_t a = 128;   //测试变量
	float b = 9.123456; //测试变量	
			
	Delay_Init();		//延时函数初始化
	LED_Init();			//LED初始化
	KEY_Init();			//按键IO口初始化
	Usart_Config ();	// USART初始化函数
	
	printf("STM32 串口实验 \r\n");
	printf("printf函数测试 \r\n");	
		
	while (1)
	{
		LED1_Toggle;
		Delay_ms(500);
		printf("十进制格式：  %d\r\n",a); 
		printf("十六进制格式：%x\r\n",a);
		printf("小数格式：    %f\r\n",b);	
	}
	
}





